tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
const char* meteringSchemeSourceName(MeteringSchemeSource source) {
    switch (source) {
        case MeteringSchemeSource::Default:
            return "默认";
        case MeteringSchemeSource::CalibrationSession:
            return "校准生成";
        case MeteringSchemeSource::Manual:
            return "手工设置";
    }
    return "-";
}

const char* waterRecordFileStatusCode(WaterRecordFileStatus status) {
    switch (status) {
        case WaterRecordFileStatus::Ready:
            return "ready";
        case WaterRecordFileStatus::Unavailable:
            return "unavailable";
        case WaterRecordFileStatus::Missing:
            return "missing";
        case WaterRecordFileStatus::InvalidPath:
            return "invalid_path";
        case WaterRecordFileStatus::InvalidCapacity:
            return "invalid_capacity";
        case WaterRecordFileStatus::BackendFailure:
            return "backend_failure";
        case WaterRecordFileStatus::Corrupt:
            return "corrupt";
        case WaterRecordFileStatus::IncompatibleFormat:
            return "incompatible_format";
    }
    return "unknown";
}

const char* waterRecordFileStatusMessage(WaterRecordFileStatus status) {
    switch (status) {
        case WaterRecordFileStatus::Ready:
            return "记录存储正常。";
        case WaterRecordFileStatus::Missing:
            return "记录文件不存在；下次写入会尝试重新创建文件。";
        case WaterRecordFileStatus::InvalidPath:
            return "记录文件路径配置无效，当前不能读取或写入出水记录。";
        case WaterRecordFileStatus::InvalidCapacity:
            return "记录文件容量配置无效，当前不能读取或写入出水记录。";
        case WaterRecordFileStatus::BackendFailure:
            return "记录文件读写失败；请检查 Flash 文件系统。";
        case WaterRecordFileStatus::Corrupt:
            return "记录文件损坏或不完整；为保护数据，系统不会自动删除。";
        case WaterRecordFileStatus::IncompatibleFormat:
            return "记录文件格式不兼容；为保护数据，系统不会自动删除。";
        case WaterRecordFileStatus::Unavailable:
        default:
            return "记录存储不可用。";
    }
}

const char* appStorageStatusCode(AppStorageStatus status) {
    switch (status) {
        case AppStorageStatus::Ready:
            return "ready";
        case AppStorageStatus::Unavailable:
            return "unavailable";
        case AppStorageStatus::Missing:
            return "missing";
        case AppStorageStatus::InvalidPath:
            return "invalid_path";
        case AppStorageStatus::BackendFailure:
            return "backend_failure";
        case AppStorageStatus::Corrupt:
            return "corrupt";
        case AppStorageStatus::IncompatibleFormat:
            return "incompatible_format";
    }
    return "unknown";
}

const char* appStorageStatusMessage(AppStorageStatus status) {
    switch (status) {
        case AppStorageStatus::Ready:
            return "存储正常。";
        case AppStorageStatus::Missing:
            return "文件缺失；系统会在下次需要写入时尝试重新创建。";
        case AppStorageStatus::InvalidPath:
            return "文件路径配置无效。";
        case AppStorageStatus::BackendFailure:
            return "文件系统读写失败，请检查 Flash/LittleFS 状态。";
        case AppStorageStatus::Corrupt:
            return "文件损坏或未写完整；为保护已有数据，系统不会自动删除。";
        case AppStorageStatus::IncompatibleFormat:
            return "文件格式不兼容；为保护可识别数据，系统不会自动删除。";
        case AppStorageStatus::Unavailable:
        default:
            return "存储尚未就绪。";
    }
}

bool activeMeteringSchemeForWeb(MeteringSchemeRecord& output) {
    if (ensureMeteringSchemesReady() && g_context.meteringSchemes->activeScheme(output)) {
        return true;
    }
    if (g_context.app) {
        output = g_context.app->activeMeteringScheme();
        return output.recordUsed;
    }
    return false;
}

#include "FaucetWebCalibrationWidgets.inc"

std::uint32_t sumRealRecordVolumeSince(std::uint32_t startTime) {
    if (!g_context.records || !g_context.records->ready() || startTime < kMinRealDateSeconds) {
        return 0;
    }
    std::uint32_t total = 0;
    WaterRecord* records = new (std::nothrow) WaterRecord[kMaxRecordPageSize]{};
    if (!records) {
        return 0;
    }
    const std::size_t count = g_context.records->count();
    for (std::size_t offset = 0; offset < count; offset += kMaxRecordPageSize) {
        const std::size_t page = offset / kMaxRecordPageSize;
        const std::size_t read = g_context.records->readPage(page, kMaxRecordPageSize, records, kMaxRecordPageSize);
        if (read == 0) {
            break;
        }
        for (std::size_t i = 0; i < read; ++i) {
            if (waterRecordHasRealTime(records[i]) && records[i].startTime >= startTime && records[i].volumeMl > 0) {
                addSaturating(total, records[i].volumeMl);
            }
        }
    }
    delete[] records;
    return total;
}

void formatRecordTime(std::uint32_t seconds, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (seconds >= kMinRealDateSeconds) {
        char date[16]{};
        formatDate(seconds, date, sizeof(date));
        const std::uint32_t daySecond = seconds % 86400UL;
        std::snprintf(out, len, "%s %02lu:%02lu:%02lu",
                      date,
                      static_cast<unsigned long>(daySecond / 3600UL),
                      static_cast<unsigned long>((daySecond / 60UL) % 60UL),
                      static_cast<unsigned long>(daySecond % 60UL));
        return;
    }
    std::snprintf(out, len, "开机+%lu s", static_cast<unsigned long>(seconds));
}

void formatRecordTimeOfDay(std::uint32_t seconds, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (seconds < kMinRealDateSeconds) {
        std::snprintf(out, len, "--:--");
        return;
    }
    const std::uint32_t daySecond = seconds % 86400UL;
    std::snprintf(out,
                  len,
                  "%02lu:%02lu:%02lu",
                  static_cast<unsigned long>(daySecond / 3600UL),
                  static_cast<unsigned long>((daySecond / 60UL) % 60UL),
                  static_cast<unsigned long>(daySecond % 60UL));
}

