tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendDateInput(const char* label, const char* name, std::uint32_t seconds) {
    char date[16]{};
    formatDate(seconds >= kMinRealDateSeconds ? seconds : 0, date, sizeof(date));
    sendFmt("<label class='field'><span>%s</span><input type='date' name='%s' value='%s'></label>",
            label,
            name,
            date);
}

void sendCheckbox(const char* label, const char* name, bool checked) {
    sendFmt("<label class='check-field'><span class='check-title'>%s</span><span class='check-line'><input type='checkbox' name='%s' value='1'%s>启用</span></label>",
            label,
            name,
            checked ? " checked" : "");
}

#include "FaucetWebHomePages.inc"

#include "FaucetWebStatsPages.inc"

#include "FaucetWebPulseTraceWidgets.inc"

#include "FaucetWebRecordsPages.inc"

void handleAppCss() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    Esp32BaseWeb::sendResponseHeader("Cache-Control", "public, max-age=86400");
    Esp32BaseWeb::sendResponseHeader("X-Content-Type-Options", "nosniff");
    if (!Esp32BaseWeb::beginResponse(200, "text/css; charset=utf-8", nullptr)) {
        return;
    }
    sendAppCss();
    Esp32BaseWeb::endResponse();
}

bool sendJsonBuffer(bool ok, const char* json) {
    if (!ok) {
        Esp32BaseWeb::sendJson(500, "{\"error\":\"buffer_too_small\"}");
        return false;
    }
    Esp32BaseWeb::sendJson(200, json);
    return true;
}

bool contextReady() {
    if (!g_context.config || !g_context.configStore || !g_context.statistics || !g_context.app || !g_context.filters ||
        !g_context.records || !g_context.nowSeconds) {
        return false;
    }
    return true;
}

bool requireContext() {
    if (!contextReady()) {
        Esp32BaseWeb::sendJson(503, "{\"error\":\"context_not_ready\"}");
        return false;
    }
    return true;
}

void handleAfterFormatFs(const Esp32BaseWeb::FormatFsResult& result, void*) {
    if (!result.formatSuccess || !g_context.configStore || !g_context.statistics || !g_context.app) {
        return;
    }

    const StatisticsRecord current = g_context.app->snapshot().statistics;
    const PeriodKeys keys{current.lastDayKey, current.lastWeekKey, current.lastMonthKey};
    g_context.statistics->reset(keys);
    if (!g_context.configStore->resetStatistics(keys)) {
        g_context.app->markPersistenceDirtyForRetry();
    }
    if (g_context.afterFormatFs) {
        g_context.afterFormatFs();
    }
}

const char* configLoadStatusName(ConfigStore::LoadStatus status) {
    switch (status) {
        case ConfigStore::LoadStatus::Defaults:
            return "defaults";
        case ConfigStore::LoadStatus::LoadedCurrent:
            return "loaded_current";
    }
    return "unknown";
}

bool getParam(const char* name, char* out, std::size_t len) {
    return Esp32BaseWeb::hasParam(name) && Esp32BaseWeb::getParam(name, out, len);
}

void applyU32Param(const char* name, std::uint32_t& value) {
    char text[24]{};
    std::uint32_t parsed = 0;
    if (getParam(name, text, sizeof(text)) && parseU32(text, parsed)) {
        value = parsed;
    }
}

bool checkboxParam(const char* name) {
    if (!Esp32BaseWeb::hasParam(name)) {
        return false;
    }
    char text[8]{};
    if (!Esp32BaseWeb::getParam(name, text, sizeof(text))) {
        return true;
    }
    return std::strcmp(text, "0") != 0 && std::strcmp(text, "false") != 0 &&
           std::strcmp(text, "off") != 0;
}

bool explicitCheckboxParam(const char* name, const char* unsetMarkerName, bool& value) {
    if (Esp32BaseWeb::hasParam(name)) {
        value = checkboxParam(name);
        return true;
    }
    if (unsetMarkerName && Esp32BaseWeb::hasParam(unsetMarkerName)) {
        value = false;
        return true;
    }
    return false;
}

bool persistPresetConfig(std::size_t index, const PresetConfig& preset) {
    if (!g_context.app->canApplyConfig() || index >= kPresetCount) {
        return false;
    }

    SystemConfig safe = g_context.configStore->loadSystemConfig();
    safe.presets[index] = preset;
    sanitizeConfig(safe);
    if (!g_context.configStore->saveSystemConfig(safe)) {
        return false;
    }
    if (!g_context.app->applyConfig(safe)) {
        return false;
    }
    *g_context.config = safe;
    if (g_context.applySettings) {
        g_context.applySettings(*g_context.config);
    }
    return true;
}

bool savePresetConfigAndReply(std::size_t index, const PresetConfig& preset) {
    if (!g_context.app->canApplyConfig()) {
        Esp32BaseWeb::sendJson(409, "{\"error\":\"busy\",\"restartRecommended\":true}");
        return false;
    }
    const bool ok = persistPresetConfig(index, preset);
    Esp32BaseWeb::sendJson(ok ? 200 : 500,
                           ok ? "{\"ok\":true,\"restartRecommended\":true}" : "{\"error\":\"save_failed\"}");
    return ok;
}

#include "FaucetWebCalibrationActions.inc"

#include "FaucetWebFiltersPersistence.inc"

void sendCurrentStatusJson() {
    const FaucetDisplayStatus displayStatus =
        g_context.currentDisplayStatus
            ? g_context.currentDisplayStatus()
            : FaucetDisplayStatus{false};
    const ConfigRuntimeStatus configStatus{
        configLoadStatusName(g_context.configStore->lastSystemConfigLoadStatus()),
        g_context.configStore->lastSystemConfigRawVersion(),
        g_context.configStore->currentSystemConfigVersion(),
    };
    AppSnapshot snapshot = g_context.app->snapshot();
    applyTargetDurationEstimate(snapshot, false);
    static char json[kStatusJsonBufferSize]{};
    json[0] = '\0';
    sendJsonBuffer(
        writeStatusJson(snapshot, displayStatus.screenOn, *g_context.config, &configStatus, json, sizeof(json)),
        json);
}

#include "FaucetWebCalibrationSession.inc"

void handleStatusApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    sendCurrentStatusJson();
}

#include "FaucetWebBusinessApi.inc"

#include "FaucetWebFiltersApi.inc"

void setFaucetWebContext(const FaucetWebContext& context) {
    g_context = context;
}

bool registerFaucetWeb() {
    if (faucetWebRouteCount() > kFaucetWebMaxRoutes) {
        return false;
    }

    Esp32BaseWeb::setHeadExtraCallback(sendAppStylesheetLink);
    Esp32BaseWeb::setAfterFormatFsCallback(handleAfterFormatFs);

    bool ok = true;
    const FaucetWebRoute* routes = faucetWebRoutes();
    for (std::size_t i = 0; i < faucetWebRouteCount(); ++i) {
        Esp32BaseWeb::Handler handler = handlerFor(routes[i]);
        if (!handler) {
            ok = false;
            continue;
        }
        if (routes[i].title && routes[i].method == FaucetWebMethod::Get) {
            ok = Esp32BaseWeb::addPage(routes[i].path, routes[i].title, handler) && ok;
        } else {
            ok = Esp32BaseWeb::addRoute(routes[i].path, toBaseMethod(routes[i].method), handler) && ok;
        }
    }
    return ok;
}

}  // namespace faucet

#endif
